content/posts/probabilistic_inference.md
+++
title = "probabilistic inference"
author = ["Cameron Smith"]
lastmod = 2020-09-20T18:12:22-04:00
slug = "probabilistic_inference"
draft = false
+++

## [references]({{< relref "references" >}}) {#references--references-dot-md}


### Books {#books}

<!--list-separator-->

-  [Pattern recognition and machine learning by Chris Bishop in 2006]({{< relref "Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006" >}})

<!--list-separator-->

-  [Statistical rethinking by Richard McElreath in 2020]({{< relref "Statistical_rethinking_by_Richard_McElreath_in_2020" >}}) with code implementing [variational inference]({{< relref "variational_inference" >}}) in [pyro]({{< relref "pyro" >}}) in [Du Phan's implementation of Statistical rethinking in pyro]({{< relref "Du_Phan's_implementation_of_Statistical_rethinking_in_pyro" >}})

<!--list-separator-->

-  [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}})


### Papers {#papers}

<!--list-separator-->

-  [The Helmholtz Machine by Peter Dayan, Geoffrey Hinton, Radford Neal, and Richard Zemel in 1995]({{< relref "The_Helmholtz_Machine_by_Peter_Dayan,_Geoffrey_Hinton,_Radford_Neal,_and_Richard_Zemel_in_1995" >}})


### Lectures {#lectures}

<!--list-separator-->

-  [ETH probabilistic AI course]({{< relref "ETH_probabilistic_AI_course" >}})

<!--list-separator-->

-  [Russ Salakhutdinov's lectures on Large Scale Machine Learning]({{< relref "Russ_Salakhutdinov's_lectures_on_Large_Scale_Machine_Learning" >}})


### People {#people}

<!--list-separator-->

-  [Chris Bishop]({{< relref "Chris_Bishop" >}})

<!--list-separator-->

-  [Karl Friston]({{< relref "Karl_Friston" >}})

<!--list-separator-->

-  [Michael I. Jordan]({{< relref "Michael_I_Jordan" >}})

<!--list-separator-->

-  [David Duvenaud]({{< relref "David_Duvenaud" >}})


## Methods {#methods}


### [variational inference]({{< relref "variational_inference" >}}) {#variational-inference--variational-inference-dot-md}


## Software libraries {#software-libraries}


### [pyro]({{< relref "pyro" >}}) {#pyro--pyro-dot-md}

<!--list-separator-->

-  ☐ Complete next element of tutorial @est(1h) @today

<!--list-separator-->

-  ☐ Deep HMM tutorial referenced in [David Duvenaud]({{< relref "David_Duvenaud" >}})'s talks on learning stochastic differential equations


### Gen {#gen}

<!--list-separator-->

- <span class="org-todo done DONE">DONE</span>  Complete ground up intro @est(1h) @done(19-11-23 01:27)

<!--list-separator-->

- <span class="org-todo done DONE">DONE</span>  Test regression example @est(1h) @done(19-11-23 02:35)

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Translate some other model @est(2h)


### [turing.jl]({{< relref "turingjl" >}}) {#turing-dot-jl--turingjl-dot-md}


### Paysage: {#paysage}

<!--list-separator-->

-  Read section I of high-bias low-variance introduction to ML
